texts = {
      'start'           :     'سلام خوش امدید',
      'start1'          :     '👤 لطفاً نام خود را وارد کنید:',
      'start2'          :     'لطفا شماره همراه خود را بصورت 09000000000 وارد کنید',
      'reserve'         :     'رزرو نوبت',
      'groom_reserve'   :     'رزرو نوبت داماد',
      'skin_reserve'    :     'رزرو نوبت خدمات پوست',
      'panel'           :     'پنل کاربری',
      'menu'            :     'منوی اصلی',
      'select_date'     :     '📆لطفا تاریخ مورد نظر را انتخاب کنید',
      'selected'        :     '📅تاریخ انتخاب شده',
      'send_phone'      :     '📱 ارسال شماره تلفن',
      'success'         :     '✅ ثبت‌نام با موفقیت شد',
      'q_confirm'       :     '✅ تایید و پرداخت',
      'back'            :     'بازگشت به منوی اصلی',
      'selected_hour'   :     'ساعت انتخاب شد',
      'selected_date'   :     'انتخاب شد',
      'card_to_card'    :     '💳کارت به کارت',
      'success_reserve' :     '✅با موفقیت انتخاب شد',
      'success_hour'    :     '✅ساعت با موفقیت انتخاب شد',
      'hour'            :     'ساعت',
      'date'            :     'تاریخ',
      'reserve_amount'  :     'مبلغ بیعانه',
      'pay'             :     'لطفا مبلغ بیعانه را به شماره کارت زیر واریز کنید و رسید پرداختی را ارسال کنید',
      'send_receipt'    :     'لطفا رسید واریزی را ارسال کنید',
      'back'            :     'منوی اصلی',
      'send_photo'      :     '📤 ارسال رسید پرداخت',
      'approve'         :     '✅تایید',
      'reject'          :     '❌رد',
      'approve_pay'     :     '✅پرداخت و رزرو شما با موفقیت تایید شد',
      'reject_pay'      :     '❌با عرض پوزش پرداخت شما رد شد لطفا دوباره تلاش کنید',
      'see_list'        :     'مشاهده لیست رزرو',
      'new_reserve'     :     '❗️شما یک رزرو جدید دارید',
      'see_detail'      :     'مشاهده جزییات',
      'name'            :     'نام',
      'phone'           :     'شماره تلفن ',
      'success_disable' :     '✅با موفقیت غیر فعال شد',
      'set_card'        :     'لطفا شماره کارت جدید را ارسال کنید',
      'success_card'    :     '✅شماره کارت جدید با موفقیت اضافه شد',
      'try_again'       :     '🔁لطفا دوباره تلاش کنید',
      'name1'            :     'بنام جواد رشیدی',
      'normal'          :     'عادی',
      'groom'           :     'داماد',
      'skin'            :     'خدمات پوست',
      'success_message' :     'پیام تبلغیاتی شما به',
      'success_message2':     'نفر ارسال شد',
      'error'           :     '⚠️ مشکلی پیش آمد. لطفاً دوباره تلاش کنید.',
      'not_found'       :     '⚠️اطلاعات کاربری پیدا نشد'   
}



months_fa = [
      "فروردین",
      "اردیبهشت", 
      "خرداد", 
      "تیر",
      "مرداد",
      "شهریور",
      "مهر", 
      "آبان",
      "آذر", 
      "دی", 
      "بهمن", 
      "اسفند"
]

weekdays_fa = [
      "شنبه" ,
      "یکشنبه",
      "دوشنبه",
      "سه‌شنبه",  
      "چهارشنبه", 
      "پنج‌شنبه", 
      "جمعه" 
]



